 [
  {
    "index": 0,
    "platform": "unknown",
    "bank_name": "chase",
    "post_text": "How does a fresh 18 year old who doesn’t pay any bills show proof of residency\nMy dad and I want open a checking bank account for me since I plan to start working and my school recommends direct deposit for my aid.  We went into a Chase bank location with my SSN and my passport but they said they needed more.  Over the phone they said a proof of residency like a sort of bill.  I searched online and the top proof a residency is utility bills, bank statements, mortgage or lease documents, and paystubs.  The thing is I don’t pay any types of bills not even a phone bill, I’ve never opened with a bank before, and I’ve never worked a job before.  I also don’t have a drivers license or state/ID.  What would you recommend I do to get proof like should I ask my dad to put me down on the phone bill or just wait until I get a job and use that.\n\nEdit: Thank you for everyone’s help and suggestion.  This has been figured out.  YES I’ve received spam mail and mail from colleges.  YES I’ve left my house before. YES I am planning to get my drivers license and State ID.  NO those can’t be used alone.  NO they won’t take anything from my school unless I was misunderstanding what they were saying.  I was finally able to reach someone and they told me to have my dad add my name to a utility or phone bill and to bring in my passport. In hindsight I should’ve just wait to get into contact with someone but thank you for all who tried to help.  I might delete this or keep it up idk.",
    "category": "customer_service",
    "sentiment_label": "negative",
    "sentiment_score": -0.5,
    "date": "2025-10-04 06:48:28",
    "user_followers": 0,
    "likes": 83,
    "shares": 0,
    "replies": 138,
    "language": "en",
    "source_url": "https://www.reddit.com/r/personalfinance/comments/1nxuhbd/how_does_a_fresh_18_year_old_who_doesnt_pay_any/",
    "post_id": "1nxuhbd",
    "hash": "37ee694cfc4fce05ce5b8358d7c6ce13"
  },
  {
    "index": 1,
    "platform": "unknown",
    "bank_name": "bank of america",
    "post_text": "NYT: How Stocks Can Be Quietly Stolen From Your I.R.A.\nI thought I'd share [this article from the NYT](https://www.nytimes.com/2025/10/03/your-money/ira-vanguard-merrill-acats-fraud.html) as this is pretty terrifying to me, and second I know many people don't check their retirement / brokerage accounts that often. I don't think the problem is limited to Vanguard, it sounds like a problem with the ACATS system. FTA:\n\n>The day before the presidential election, Mr. Tran, who oversees his family’s retirement accounts, decided to sell a solar energy stock inside his wife’s Roth individual retirement account...he discovered that half of the holdings inside that Vanguard account had vanished.\n\n>Mr. Tran called Vanguard, which froze the I.R.A. and began to investigate. The money, it turns out, had been whisked away four days earlier, and transferred to another brokerage platform, Merrill Edge.\n\n>A criminal impostor opened two accounts in Mr. Tran’s wife’s name at Merrill and requested the transfer from Vanguard, but the fraudster hadn’t yet run off with the money. Merrill, part of Bank of America, froze the funds.\n\n>...\n\n>It happens frequently enough: Regulators have issued notices in recent years warning that this type of crime — known as ACATS fraud — was on the rise.\n\n>...\n\n>It often happens like this: The criminal opens up a new account in a target’s name, using stolen data or a combination of stolen and false information (like an email address or a mobile phone number). Opening an account at Merrill Edge, as well as many other online brokers, doesn’t require much. That’s what the fraudsters did here, and Bank of America said it had received the all clear when it had run identify verification checks.\n\n>With the new account, the impostor can request a transfer from another existing account, just like a real customer, which the institutions complete through the ACATS framework.\n\n>...\n\n>With all of those pieces in hand, the transfer can then happen really quickly — ACATS is fast and largely automated.\n\n>...\n\n>“The ACATS process was designed for speed, and doesn’t really have good fraud controls in place,” said Gavin Holland, a financial crimes executive at SAS, a data and artificial intelligence company. The firm holding the assets rarely goes beyond a basic check, and it usually doesn’t even notify the customer that the transfer is about to happen. (Vanguard notifies customers after the transfer is completed.)\n\n>...\n\n>**In a digital world where sophisticated fraudsters are continuously fine-tuning their strategies, the couple’s situation underscores the importance of checking on your accounts — criminals may try to stay under the radar and siphon small amounts at time.**\n\n>**Ask your financial providers what sort of notifications they send if money was transferred out, make sure the alerts are turned on and ask the firms if they have locking features to prevent this type of activity. If they don’t, demand them. Always use two-factor authentication, guard your brokerage account numbers and shred paper statements if you absolutely insist on receiving them that way. Practice good email hygiene, too.**",
    "category": "account_management",
    "sentiment_label": "negative",
    "sentiment_score": -0.8,
    "date": "2025-10-03 22:47:38",
    "user_followers": 0,
    "likes": 52,
    "shares": 0,
    "replies": 10,
    "language": "en",
    "source_url": "https://www.reddit.com/r/personalfinance/comments/1nxlx68/nyt_how_stocks_can_be_quietly_stolen_from_your_ira/",
    "post_id": "1nxlx68",
    "hash": "5bb6a1609ee61d249aeb9fe46566499f"
  },
  {
    "index": 2,
    "platform": "unknown",
    "bank_name": "chime",
    "post_text": "Start here! Common questions & resources\nThe community has asked a few times for a stickied post that covers common questions and best practices. We are keeping these items high-level and will update these periodically. For individuals who make new posts, we may refer them back to here for guidance and resources that have been vetted for common questions. Note: Most, if not all, of the guidance may be US-specific.\n\nGeneral questions (Ex: *Bank or credit union? What bank do you recommend? Why can't I open an account at ABC bank?*):\n\n* **Ask your bank first.** This is also referenced in Rule 8. Lots of questions here are either specific to the bank's process or specific to the redditor and their account. Read your bank's account agreement (if on a computer or phone, you can search for specific words to help navigate the document; you can also ask the bank to direct you to the right section). If you asked your bank and are still have questions, include their response in your post.\n* **Banks and credit unions do have similar products and services**. There is no key difference for individuals who need a place to put their money and pay their bills. They are both regulated at the federal level and have deposit insurance.\n* **When asking for recommendations, there is no \"best bank\".** What you need from your financial institution is different than your friends, family and neighbors. Your income, comfort level with technology, location, and a lot of other factors will influence what bank works best for you. If you need recommendations, please include some key features you like or don't like as well as location.\n* **Fintechs are not banks.** Some common examples include Chime, CashApp, Revolut, and Varo. There are some benefits with fintechs, including some cutting edge technology to help manage money but those come with some limitations, such as limited customer support or consumer protections. It's generally not recommended to use a fintech as your sole financial institution.\n* **Some practices by banks and/or credit unions may be state-specific**. While the Uniform Commercial Code (\"UCC\") helps ensure state-level regulations on accounts is relatively uniform across all states to avoid confusion, some nuanced laws may be unique to your location, such as account dormancy and escheat laws. [https://www.law.cornell.edu/ucc](https://www.law.cornell.edu/ucc)\n* **Consumer reporting agencies such as Chexsystems and Early Warning Systems (\"EWS\") help banks flag customers who owe money or commit fraud.** If you've been denied an account opening request at a bank or credit union, you should pull your report(s) to see what may have contributed to the decision. These reports are different from credit agencies. [https://www.consumerfinance.gov/consumer-tools/credit-reports-and-scores/consumer-reporting-companies/](https://www.consumerfinance.gov/consumer-tools/credit-reports-and-scores/consumer-reporting-companies/)\n\nAccounts & activity:\n\n* **Accounts can be closed for any reason by the bank and/or credit union.** This applies to both consumer and business accounts. Generally the closures are triggered by some type of activity that makes the bank uncomfortable with your relationship. Common examples are gambling (i.e. sports betting, casinos), high volumes of cryptocurrency purchases and using your personal account for business transactions. Banks are not required to provide the exact reason for the closure.  [https://www.consumerfinance.gov/ask-cfpb/the-bankcredit-union-closed-my-checking-account-even-though-i-did-not-want-them-to-can-the-bankcredit-union-do-that-en-959/](https://www.consumerfinance.gov/ask-cfpb/the-bankcredit-union-closed-my-checking-account-even-though-i-did-not-want-them-to-can-the-bankcredit-union-do-that-en-959/)\n* **Check holds can happen and are not illegal in a majority of cases.** There's a lot of fraud related to checks and holds are more common than ever. Remember that a check is a piece of paper; it doesn't matter what paper it's printed on or who it came from. Regulation CC (\"Reg CC\") is the regulation that tells banks how long they are allowed to hold checks for. You can get more details here: [https://www.consumerfinance.gov/rules-policy/final-rules/availability-funds-and-collection-checks-regulation-cc-threshold-adjustments/](https://www.consumerfinance.gov/rules-policy/final-rules/availability-funds-and-collection-checks-regulation-cc-threshold-adjustments/)\n* **Do not deposit your very important items via an ATM or Mobile App.** Go in person to a teller. ATMs are often not accessible by the branch employees and mobile deposits are not subject to the Reg CC. Cash is disgusting and the ribbons that pull in and count the cash get jammed very easily if it's more than a few bills.\n* **Withdrawing or depositing over $10,000 in cash is not something you should hide.** Just go to the bank and do it. Don't ask how to get around any questions you may be asked. Banks will know if you are trying to split up the deposit into multiple transactions. If the money is earned through legitimate means, you have nothing to hide. [https://www.fincen.gov/sites/default/files/shared/CTRPamphlet.pdf](https://www.fincen.gov/sites/default/files/shared/CTRPamphlet.pdf)\n* **I have a check payable to me and another person but we don't have a joint account.** There is a key difference depending on if the check is payable to Payee 1 AND Payee 2 or if the check is payable to Payee 1 OR Payee 2. You can first ask the maker of the check to write it payable to 1 payee. If they refuse, whoever has the check can take it into their bank before endorsing it to see what they provide as the appropriate next steps since what they advise could vary bank to bank. [https://www.helpwithmybank.gov/help-topics/bank-accounts/check-writing-cashing/endorsing-checks/check-endorse-spouse.html](https://www.helpwithmybank.gov/help-topics/bank-accounts/check-writing-cashing/endorsing-checks/check-endorse-spouse.html) \n* **I want to remove somoene from my joint account.** YMMV but most banks generally do not allow removing a signer because they still have knowledge of the account information. Even if you have captured consent, it was still used by 2 folks and it's a cleaner cut to open a new, individual account and closing the old one. [https://www.consumerfinance.gov/ask-cfpb/can-i-remove-my-spouse-from-our-joint-checking-account-en-1097/#:\\~:text=In%20general%2C%20you%20need%20your,allow%20this%20type%20of%20removal](https://www.consumerfinance.gov/ask-cfpb/can-i-remove-my-spouse-from-our-joint-checking-account-en-1097/#:~:text=In%20general%2C%20you%20need%20your,allow%20this%20type%20of%20removal) \n\n* **My bank offers a service where they deposit my direct deposit/payroll 2 days early. It’s now late and my employer said they can’t help.**  Early direct deposit posting is a service offered and can be changed at any time by the bank. Read your bank’s terms for this service. Most banks indicate that they will make it available when they can but are under no obligation to make your direct deposit available sooner than the date of your check or benefit letter. \n\nDisputes:\n\n* **Don't lie.** The fact that this needs to be listed is problematic. If you bought something from a store that doesn't offer refunds, that's not grounds for a dispute. If you sent a Zelle to someone that you've had a falling out with, that's not grounds for a dispute. Frivolous disputes make it harder for others who have legitimate ones in process.\n* **Disputes are not the solution for being scammed.** If you provided your information to someone else to make a purchase or deposit, then the bank did nothing wrong and a dispute is not warranted. Scams take advantage of people who don't safeguard their information.\n* **If the purchase was made using a third-party wallet, the dispute should be filed with them and not your bank.** For example, people may use PayPal Wallet to pay for items online. PayPal completes the payment and then pulls the money from your bank, if you don't already have enough in your PayPal Wallet. Because the payment to the merchant was facilitated with PayPal, your dispute is with them, not your bank. Your bank only sees the transfer to your PayPal wallet, not the actual purchase you made.\n* **If you submitted a legitimate dispute with all the requested proof and were denied, file an internal complaint with the bank.** These are handled differently than the dispute itself. The next step, if still unresolved after the complaint, is to file a CFPB complaint. Do not abuse the CFPB complaint process unless you have all the receipts and documentation to prove your side of the story. You may need a police report depending on the nature of your dispute. [https://www.consumerfinance.gov/complaint/](https://www.consumerfinance.gov/complaint/)\n\nCommon scams - [https://www.consumerfinance.gov/consumer-tools/fraud/](https://www.consumerfinance.gov/consumer-tools/fraud/)\n\n* **If your bank calls you about anything and begins asking for additional information, advise that you'll call them back.** If the caller is actually someone from your bank, they will understand and won't fight to keep you on the line. Hang up and call the number on the back of your debit card and let them know what happened. If it was a legitimate call, the bank can pick up where the previous caller left off.\n* **Jobs that pay you before you do any work have a high probability to be a scam.** Jobs that also pay you hundreds or thousands of dollars to buy supplies prior to starting are also probably a scam. No job does that. They will ship you items you need because they get a big tax write-off.\n* **Don't deposit checks that you weren't expecting.** If you get a check for $500 in the mail from a random company you've never done business with or purchased from, just throw it away.\n* **Online stores that you've never heard of should be used with extreme caution**. Google them before you proceed. Once you willingly provide your payment information, you may not be able to recover any funds from the transaction if items are not shipped.\n* **Don't transfer money to people you don't know.** This includes Zelle, Paypal, Venmo, CashApp, etc. Some bankers may even go so far as not recommending it for in-person pickups for sales on Facebook Marketplace or similar platforms. Cash is best in these situations.\n* **Don't use your account to conduct transactions for someone else.** A common scam is where someone may approach you saying they need help with negotiating a check (usually while you're at an ATM). They'll have a sob story to appeal to your desire to help. Your account should remain reserved for known transactions for you and you only. This also includes providing someone else with your username and password.\n\nBusiness accounts:\n\n* **Business accounts do not receive all the same protections as consumer accounts.** For example, disputes are handled very differently. [https://ask.fdic.gov/fdicinformationandsupportcenter/s/article/Q-Do-consumer-laws-apply-to-my-business-accounts?language=en\\_US](https://ask.fdic.gov/fdicinformationandsupportcenter/s/article/Q-Do-consumer-laws-apply-to-my-business-accounts?language=en_US)\n* **Generally, only individuals who have a physical tie to the US can open bank accounts in the US.** This also means that non-US residents who have a US-based business may not be eligible because the person operating the business has no ties to the US. Banks are required to follow certain know-your-customer guidelines as outlined in the US PATRIOT Act and those cannot be completed when the person is not physically in the US or has no ties to the US. More details here:  [https://www.fincen.gov/resources/statutes-regulations/usa-patriot-act](https://www.fincen.gov/resources/statutes-regulations/usa-patriot-act)",
    "category": "account_management",
    "sentiment_label": "negative",
    "sentiment_score": -0.8,
    "date": "2024-12-05 08:09:30",
    "user_followers": 0,
    "likes": 6,
    "shares": 0,
    "replies": 8,
    "language": "en",
    "source_url": "https://www.reddit.com/r/Banking/comments/1h7cogo/start_here_common_questions_resources/",
    "post_id": "1h7cogo",
    "hash": "38753627ea3d2545763426e600097e08"
  },
  {
    "index": 3,
    "platform": "unknown",
    "bank_name": "revolut",
    "post_text": "Start here! Common questions & resources\nThe community has asked a few times for a stickied post that covers common questions and best practices. We are keeping these items high-level and will update these periodically. For individuals who make new posts, we may refer them back to here for guidance and resources that have been vetted for common questions. Note: Most, if not all, of the guidance may be US-specific.\n\nGeneral questions (Ex: *Bank or credit union? What bank do you recommend? Why can't I open an account at ABC bank?*):\n\n* **Ask your bank first.** This is also referenced in Rule 8. Lots of questions here are either specific to the bank's process or specific to the redditor and their account. Read your bank's account agreement (if on a computer or phone, you can search for specific words to help navigate the document; you can also ask the bank to direct you to the right section). If you asked your bank and are still have questions, include their response in your post.\n* **Banks and credit unions do have similar products and services**. There is no key difference for individuals who need a place to put their money and pay their bills. They are both regulated at the federal level and have deposit insurance.\n* **When asking for recommendations, there is no \"best bank\".** What you need from your financial institution is different than your friends, family and neighbors. Your income, comfort level with technology, location, and a lot of other factors will influence what bank works best for you. If you need recommendations, please include some key features you like or don't like as well as location.\n* **Fintechs are not banks.** Some common examples include Chime, CashApp, Revolut, and Varo. There are some benefits with fintechs, including some cutting edge technology to help manage money but those come with some limitations, such as limited customer support or consumer protections. It's generally not recommended to use a fintech as your sole financial institution.\n* **Some practices by banks and/or credit unions may be state-specific**. While the Uniform Commercial Code (\"UCC\") helps ensure state-level regulations on accounts is relatively uniform across all states to avoid confusion, some nuanced laws may be unique to your location, such as account dormancy and escheat laws. [https://www.law.cornell.edu/ucc](https://www.law.cornell.edu/ucc)\n* **Consumer reporting agencies such as Chexsystems and Early Warning Systems (\"EWS\") help banks flag customers who owe money or commit fraud.** If you've been denied an account opening request at a bank or credit union, you should pull your report(s) to see what may have contributed to the decision. These reports are different from credit agencies. [https://www.consumerfinance.gov/consumer-tools/credit-reports-and-scores/consumer-reporting-companies/](https://www.consumerfinance.gov/consumer-tools/credit-reports-and-scores/consumer-reporting-companies/)\n\nAccounts & activity:\n\n* **Accounts can be closed for any reason by the bank and/or credit union.** This applies to both consumer and business accounts. Generally the closures are triggered by some type of activity that makes the bank uncomfortable with your relationship. Common examples are gambling (i.e. sports betting, casinos), high volumes of cryptocurrency purchases and using your personal account for business transactions. Banks are not required to provide the exact reason for the closure.  [https://www.consumerfinance.gov/ask-cfpb/the-bankcredit-union-closed-my-checking-account-even-though-i-did-not-want-them-to-can-the-bankcredit-union-do-that-en-959/](https://www.consumerfinance.gov/ask-cfpb/the-bankcredit-union-closed-my-checking-account-even-though-i-did-not-want-them-to-can-the-bankcredit-union-do-that-en-959/)\n* **Check holds can happen and are not illegal in a majority of cases.** There's a lot of fraud related to checks and holds are more common than ever. Remember that a check is a piece of paper; it doesn't matter what paper it's printed on or who it came from. Regulation CC (\"Reg CC\") is the regulation that tells banks how long they are allowed to hold checks for. You can get more details here: [https://www.consumerfinance.gov/rules-policy/final-rules/availability-funds-and-collection-checks-regulation-cc-threshold-adjustments/](https://www.consumerfinance.gov/rules-policy/final-rules/availability-funds-and-collection-checks-regulation-cc-threshold-adjustments/)\n* **Do not deposit your very important items via an ATM or Mobile App.** Go in person to a teller. ATMs are often not accessible by the branch employees and mobile deposits are not subject to the Reg CC. Cash is disgusting and the ribbons that pull in and count the cash get jammed very easily if it's more than a few bills.\n* **Withdrawing or depositing over $10,000 in cash is not something you should hide.** Just go to the bank and do it. Don't ask how to get around any questions you may be asked. Banks will know if you are trying to split up the deposit into multiple transactions. If the money is earned through legitimate means, you have nothing to hide. [https://www.fincen.gov/sites/default/files/shared/CTRPamphlet.pdf](https://www.fincen.gov/sites/default/files/shared/CTRPamphlet.pdf)\n* **I have a check payable to me and another person but we don't have a joint account.** There is a key difference depending on if the check is payable to Payee 1 AND Payee 2 or if the check is payable to Payee 1 OR Payee 2. You can first ask the maker of the check to write it payable to 1 payee. If they refuse, whoever has the check can take it into their bank before endorsing it to see what they provide as the appropriate next steps since what they advise could vary bank to bank. [https://www.helpwithmybank.gov/help-topics/bank-accounts/check-writing-cashing/endorsing-checks/check-endorse-spouse.html](https://www.helpwithmybank.gov/help-topics/bank-accounts/check-writing-cashing/endorsing-checks/check-endorse-spouse.html) \n* **I want to remove somoene from my joint account.** YMMV but most banks generally do not allow removing a signer because they still have knowledge of the account information. Even if you have captured consent, it was still used by 2 folks and it's a cleaner cut to open a new, individual account and closing the old one. [https://www.consumerfinance.gov/ask-cfpb/can-i-remove-my-spouse-from-our-joint-checking-account-en-1097/#:\\~:text=In%20general%2C%20you%20need%20your,allow%20this%20type%20of%20removal](https://www.consumerfinance.gov/ask-cfpb/can-i-remove-my-spouse-from-our-joint-checking-account-en-1097/#:~:text=In%20general%2C%20you%20need%20your,allow%20this%20type%20of%20removal) \n\n* **My bank offers a service where they deposit my direct deposit/payroll 2 days early. It’s now late and my employer said they can’t help.**  Early direct deposit posting is a service offered and can be changed at any time by the bank. Read your bank’s terms for this service. Most banks indicate that they will make it available when they can but are under no obligation to make your direct deposit available sooner than the date of your check or benefit letter. \n\nDisputes:\n\n* **Don't lie.** The fact that this needs to be listed is problematic. If you bought something from a store that doesn't offer refunds, that's not grounds for a dispute. If you sent a Zelle to someone that you've had a falling out with, that's not grounds for a dispute. Frivolous disputes make it harder for others who have legitimate ones in process.\n* **Disputes are not the solution for being scammed.** If you provided your information to someone else to make a purchase or deposit, then the bank did nothing wrong and a dispute is not warranted. Scams take advantage of people who don't safeguard their information.\n* **If the purchase was made using a third-party wallet, the dispute should be filed with them and not your bank.** For example, people may use PayPal Wallet to pay for items online. PayPal completes the payment and then pulls the money from your bank, if you don't already have enough in your PayPal Wallet. Because the payment to the merchant was facilitated with PayPal, your dispute is with them, not your bank. Your bank only sees the transfer to your PayPal wallet, not the actual purchase you made.\n* **If you submitted a legitimate dispute with all the requested proof and were denied, file an internal complaint with the bank.** These are handled differently than the dispute itself. The next step, if still unresolved after the complaint, is to file a CFPB complaint. Do not abuse the CFPB complaint process unless you have all the receipts and documentation to prove your side of the story. You may need a police report depending on the nature of your dispute. [https://www.consumerfinance.gov/complaint/](https://www.consumerfinance.gov/complaint/)\n\nCommon scams - [https://www.consumerfinance.gov/consumer-tools/fraud/](https://www.consumerfinance.gov/consumer-tools/fraud/)\n\n* **If your bank calls you about anything and begins asking for additional information, advise that you'll call them back.** If the caller is actually someone from your bank, they will understand and won't fight to keep you on the line. Hang up and call the number on the back of your debit card and let them know what happened. If it was a legitimate call, the bank can pick up where the previous caller left off.\n* **Jobs that pay you before you do any work have a high probability to be a scam.** Jobs that also pay you hundreds or thousands of dollars to buy supplies prior to starting are also probably a scam. No job does that. They will ship you items you need because they get a big tax write-off.\n* **Don't deposit checks that you weren't expecting.** If you get a check for $500 in the mail from a random company you've never done business with or purchased from, just throw it away.\n* **Online stores that you've never heard of should be used with extreme caution**. Google them before you proceed. Once you willingly provide your payment information, you may not be able to recover any funds from the transaction if items are not shipped.\n* **Don't transfer money to people you don't know.** This includes Zelle, Paypal, Venmo, CashApp, etc. Some bankers may even go so far as not recommending it for in-person pickups for sales on Facebook Marketplace or similar platforms. Cash is best in these situations.\n* **Don't use your account to conduct transactions for someone else.** A common scam is where someone may approach you saying they need help with negotiating a check (usually while you're at an ATM). They'll have a sob story to appeal to your desire to help. Your account should remain reserved for known transactions for you and you only. This also includes providing someone else with your username and password.\n\nBusiness accounts:\n\n* **Business accounts do not receive all the same protections as consumer accounts.** For example, disputes are handled very differently. [https://ask.fdic.gov/fdicinformationandsupportcenter/s/article/Q-Do-consumer-laws-apply-to-my-business-accounts?language=en\\_US](https://ask.fdic.gov/fdicinformationandsupportcenter/s/article/Q-Do-consumer-laws-apply-to-my-business-accounts?language=en_US)\n* **Generally, only individuals who have a physical tie to the US can open bank accounts in the US.** This also means that non-US residents who have a US-based business may not be eligible because the person operating the business has no ties to the US. Banks are required to follow certain know-your-customer guidelines as outlined in the US PATRIOT Act and those cannot be completed when the person is not physically in the US or has no ties to the US. More details here:  [https://www.fincen.gov/resources/statutes-regulations/usa-patriot-act](https://www.fincen.gov/resources/statutes-regulations/usa-patriot-act)",
    "category": "account_management",
    "sentiment_label": "negative",
    "sentiment_score": -0.8,
    "date": "2024-12-05 08:09:30",
    "user_followers": 0,
    "likes": 6,
    "shares": 0,
    "replies": 8,
    "language": "en",
    "source_url": "https://www.reddit.com/r/Banking/comments/1h7cogo/start_here_common_questions_resources/",
    "post_id": "1h7cogo",
    "hash": "e29f61edebf59cc455e81e9cb488bf1a"
  },
  {
    "index": 4,
    "platform": "unknown",
    "bank_name": "wells fargo",
    "post_text": "Fastest way to move money from one bank to another?\nWhat is the fastest way to switch my money from one bank to another? I’m finally switching completely from Wells Fargo to a credit union. I already have all of my savings in the credit union, and just need to move what’s left in the WF account (and close the account). Is there a faster way than an ACH transfer? ",
    "category": "account_management",
    "sentiment_label": "negative",
    "sentiment_score": -0.5,
    "date": "2025-10-03 06:46:11",
    "user_followers": 0,
    "likes": 12,
    "shares": 0,
    "replies": 34,
    "language": "en",
    "source_url": "https://www.reddit.com/r/Banking/comments/1nwzlx1/fastest_way_to_move_money_from_one_bank_to_another/",
    "post_id": "1nwzlx1",
    "hash": "03396a702d9b46f70ef90f3b503c1f95"
  },
  {
    "index": 5,
    "platform": "unknown",
    "bank_name": "chase",
    "post_text": "Chase won't allow me to deposit check unless all payees are named on the checking account even if endorsed.\nI got an Insurance check from  Statefarm. Aside from my wife and I, there are two other payees. The mortgage bank and another the SBA that has a lein. I got the check endorsed by both the SBA and the mortgage bank. I went to chase to deposit the check into my checking account. They are NOT the mortgage bank. They said they can't cash a check unless all payees are on the checking account EVEN IF the other payess (namely the other banks) . Not sure what to do now. ",
    "category": "account_management",
    "sentiment_label": "negative",
    "sentiment_score": -0.5,
    "date": "2025-10-03 11:53:34",
    "user_followers": 0,
    "likes": 5,
    "shares": 0,
    "replies": 35,
    "language": "en",
    "source_url": "https://www.reddit.com/r/Banking/comments/1nx7s7h/chase_wont_allow_me_to_deposit_check_unless_all/",
    "post_id": "1nx7s7h",
    "hash": "7ed20e7e31492a515b37ad4739622c11"
  }
]